{
  "backend/main.mo": "Defines canister with category, worker, and inquiry types, authorization and approval logic, and in‑memory maps for stored entities.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of numerous frontend source files for reference.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theming, i18n, and global layout for the React app.",
  "frontend/src/components/admin/CategoriesAdminPanel.tsx": "Admin UI for viewing, creating, editing, and deleting service categories using React Query hooks.",
  "frontend/src/components/admin/InquiriesAdminPanel.tsx": "Admin panel for viewing, filtering, updating, and deleting customer inquiries with status management and error handling.",
  "frontend/src/components/admin/WorkersAdminPanel.tsx": "Admin interface for managing workers, including approval, category updates, publishing, and linked inquiry completion.",
  "frontend/src/components/alarms/PostCallAlarmHost.tsx": "Hosts and triggers the post-call alarm modal based on alarm state from usePostCallAlarm.",
  "frontend/src/components/alarms/PostCallAlarmModal.tsx": "Modal that plays an alarm sound and blocks dismissal except via an OK button to remind workers of a service visit.",
  "frontend/src/components/alarms/useAlarmSound.ts": "Hook that plays a short alarm sound when triggered and handles autoplay failures and cleanup.",
  "frontend/src/components/auth/InternetIdentityErrorNotice.tsx": "Displays a detailed error notice for Internet Identity login failures with troubleshooting tips and retry support.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication, error states, logging diagnostics, and retries.",
  "frontend/src/components/Brand.tsx": "Small component rendering the SevaSangam brand text in three languages.",
  "frontend/src/components/categories/CategoryCardGrid.tsx": "Renders a grid of service categories linking to their respective pages with images and names.",
  "frontend/src/components/errors/ConnectionErrorNotice.tsx": "Shows a connection error alert with suggested fixes and a retry button.",
  "frontend/src/components/guards/RequireAdmin.tsx": "Route guard that checks admin authentication and redirects or shows loading/error states accordingly.",
  "frontend/src/components/guards/RequireAuth.tsx": "Route guard enforcing user authentication with Internet Identity and handles login errors and retries.",
  "frontend/src/components/layout/AppLayout.tsx": "Application layout wrapper providing header, footer, and main content structure.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying localized copyright text.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation links, language selector, and auth-based actions for workers and admins.",
  "frontend/src/components/search/HomeSearchPanel.tsx": "Search panel for selecting category, location, and availability, then navigating to filtered search results.",
  "frontend/src/components/workers/PhotoPicker.tsx": "Image upload component that previews selected photos, converts them to ExternalBlob, and allows removal.",
  "frontend/src/components/workers/WorkerCard.tsx": "Displays a worker’s basic info with photo, experience, location, and a link to view their profile.",
  "frontend/src/components/workers/WorkerContactActions.tsx": "Provides call and WhatsApp action buttons for contacting a worker and triggers call tracking.",
  "frontend/src/components/workers/WorkerJobsList.tsx": "Lists worker job inquiries with status indicators and details, or shows an empty state if none exist.",
  "frontend/src/components/workers/WorkerProfileEditor.tsx": "Form for editing a worker profile including personal info, photo, availability, and pricing before resubmission.",
  "frontend/src/components/workers/WorkerRegistrationForm.tsx": "Form for new worker registration collecting personal, category, availability, and pricing info, then submitting a WorkerProfile.",
  "frontend/src/hooks/useActor.ts": "Creates and refreshes a backend actor based on Internet Identity, initializing admin access when available and invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin login state using actor credential validation and session storage with helpers for login, logout, and credential retrieval.",
  "frontend/src/hooks/useAuthz.ts": "Combines Internet Identity and admin session state to expose worker and admin authentication flags.",
  "frontend/src/hooks/useI18n.ts": "Simple hook exposing the I18n context for translation use.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling AuthClient setup, login, state restoration, and identity status flags.",
  "frontend/src/hooks/usePostCallAlarm.ts": "Tracks a call marker in session storage and triggers a one‑time post‑call alarm if conditions are met.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, categories, and admin-protected mutations, integrating actor state and admin session handling.",
  "frontend/src/i18n/I18nProvider.tsx": "I18n provider storing language preference in localStorage and offering translation utilities via context.",
  "frontend/src/i18n/index.ts": "Implements translation lookup, nested key resolution, pluralization, and template interpolation for supported languages.",
  "frontend/src/i18n/locales/as.ts": "Provides Assamese translation strings for UI components, pages, and common labels.",
  "frontend/src/i18n/locales/en.ts": "English translation file containing UI text for common labels, pages, and components.",
  "frontend/src/i18n/locales/hi.ts": "Hindi translation file providing localized UI text for common labels, pages, and components.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables, dark mode values, and hero image glow animations.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for managing workers, categories, and inquiries, wrapped in an admin guard.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login form handling authentication, loading states, and redirects based on session status.",
  "frontend/src/pages/CategoriesIndexPage.tsx": "Page showing a list of service categories using a category card grid.",
  "frontend/src/pages/CategoryPage.tsx": "Category detail page that fetches workers by category and displays loading, error, empty, or worker list states.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, search panel, and category grid using i18n and navigation.",
  "frontend/src/pages/SearchResultsPage.tsx": "Fetches workers and filters them by category, location, and availability, handling loading, error, and empty states.",
  "frontend/src/pages/WorkerDashboardPage.tsx": "Displays and manages the worker dashboard with profile editing, job list retrieval, and connection error handling.",
  "frontend/src/pages/WorkerOnboardingPage.tsx": "Handles worker onboarding flow including login, profile setup, registration, and network error recovery.",
  "frontend/src/pages/WorkerProfilePage.tsx": "Shows a worker’s public profile with photo, experience, location, availability, pricing, and contact actions.",
  "frontend/src/utils/adminApiErrorHandling.ts": "Provides utility functions to detect admin API errors, clear sessions, and generate user-facing error messages.",
  "frontend/src/utils/adminSessionStorage.ts": "Implements admin session persistence using sessionStorage with helpers to save, load, clear, and check session status.",
  "frontend/src/utils/authDiagnostics.ts": "Logs structured, safe diagnostic events for Internet Identity authentication, including attempts, successes, and failures.",
  "frontend/src/utils/categories.ts": "Defines category IDs, display names, and functions mapping categories to icon indices and image paths.",
  "frontend/src/utils/contactLinks.ts": "Provides helpers to normalize phone numbers and generate tel/WhatsApp links.",
  "frontend/src/utils/urlParams.ts": "Implements utilities to read, store, retrieve, and clear URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugin usage for the frontend.",
  "project_state.json": "Stores project state, known issues, and feature requests related to worker dashboard simplification and admin job completion actions."
}