{
  "backend/main.mo": "Motoko canister defining category, worker, and inquiry types with access control, approval flow, and in-memory maps for storing all entities.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing short descriptions of many frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and applying base styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining all app routes and global providers like Theme and I18n.",
  "frontend/src/components/admin/CategoriesAdminPanel.tsx": "Admin UI for listing, creating, editing, and deleting service categories using React Query mutations.",
  "frontend/src/components/admin/InquiriesAdminPanel.tsx": "Admin panel for viewing, filtering, updating, and deleting inquiries with error handling and status management.",
  "frontend/src/components/admin/WorkersAdminPanel.tsx": "Admin panel to approve, reject, publish, remove, or update worker categories, using dialogs and query hooks.",
  "frontend/src/components/alarms/PostCallAlarmHost.tsx": "Mount-level component that checks for and triggers post-call alarms, rendering the alarm modal when needed.",
  "frontend/src/components/alarms/PostCallAlarmModal.tsx": "Modal that plays an alarm sound, blocks dismissal via escape or outside clicks, and prompts the user to acknowledge a service reminder.",
  "frontend/src/components/alarms/useAlarmSound.ts": "Hook that plays an alarm sound for a fixed duration and handles autoplay issues and cleanup.",
  "frontend/src/components/auth/InternetIdentityErrorNotice.tsx": "Displays an error notice for Internet Identity login failures with troubleshooting steps and a retry button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication, status logging, retries, and error display.",
  "frontend/src/components/Brand.tsx": "Simple component displaying the SevaSangam brand name in English, Hindi, and Assamese.",
  "frontend/src/components/categories/CategoryCardGrid.tsx": "Renders a grid of category cards linking to category pages with images and names.",
  "frontend/src/components/errors/ConnectionErrorNotice.tsx": "Shows a connection error alert with troubleshooting tips and a retry option.",
  "frontend/src/components/guards/RequireAdmin.tsx": "Route guard that checks admin authentication and redirects or displays loading/error states.",
  "frontend/src/components/guards/RequireAuth.tsx": "Authentication guard prompting Internet Identity login and handling login errors before rendering children.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component wrapping pages with a header, footer, and main content area.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying a translated copyright message.",
  "frontend/src/components/layout/Header.tsx": "Top navigation bar with links, language selector, auth‑dependent actions, and mobile menu logic.",
  "frontend/src/components/search/HomeSearchPanel.tsx": "Search form allowing users to filter by category, location, and availability, then navigate to results.",
  "frontend/src/components/workers/PhotoPicker.tsx": "Image uploader for worker photos with preview, removal, and conversion to ExternalBlob.",
  "frontend/src/components/workers/WorkerCard.tsx": "Displays a worker’s basic info, photo, location, and a button linking to their profile.",
  "frontend/src/components/workers/WorkerContactActions.tsx": "Provides call and WhatsApp contact buttons and triggers a call-start hook.",
  "frontend/src/components/workers/WorkerJobsList.tsx": "Renders a list of worker jobs with status badges and details, or an empty state when none exist.",
  "frontend/src/components/workers/WorkerProfileEditor.tsx": "Form for editing an existing worker profile, handling validation, photo updates, and reapproval warnings.",
  "frontend/src/components/workers/WorkerRegistrationForm.tsx": "Registration form for new workers including identity integration, photo upload, and profile construction.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminSession.ts": "Handles admin login by validating credentials through the actor and storing or clearing admin session data.",
  "frontend/src/hooks/useAuthz.ts": "Combines worker identity and admin session state to expose simple authorization flags.",
  "frontend/src/hooks/useI18n.ts": "Provides access to the i18n context for translations and language settings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity, login, logout, and status tracking via context.",
  "frontend/src/hooks/usePostCallAlarm.ts": "Tracks call start events in session storage and triggers a timed post-call alarm.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, categories, and admin-protected mutations using the backend actor.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides a translation context with language persistence and a translate helper.",
  "frontend/src/i18n/index.ts": "Implements translation lookup, pluralization, interpolation, and language registry.",
  "frontend/src/i18n/locales/as.ts": "Contains Assamese translation strings for UI components and pages.",
  "frontend/src/i18n/locales/en.ts": "English locale definitions containing UI text strings for common actions, navigation, pages, and worker-related messaging.",
  "frontend/src/i18n/locales/hi.ts": "Hindi locale definitions mirroring the English set, providing translations for UI text, navigation, and worker-related content.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and component styling including a hero image glow effect.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for managing workers, categories, and inquiries, wrapped in an admin access guard.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login form handling authentication, error states, and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/CategoriesIndexPage.tsx": "Page displaying the list of service categories using a grid component with introductory text.",
  "frontend/src/pages/CategoryPage.tsx": "Category detail page fetching workers by category and showing loading, error, empty, or worker list states.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, search panel, and category grid with navigation actions.",
  "frontend/src/pages/SearchResultsPage.tsx": "Displays filtered worker search results with loading, error, and empty states, plus filter controls.",
  "frontend/src/pages/WorkerDashboardPage.tsx": "Worker dashboard for viewing and editing profile, managing jobs, and handling connection or missing-profile states.",
  "frontend/src/pages/WorkerOnboardingPage.tsx": "Handles login via Internet Identity, user profile setup, worker registration, and connection or login errors.",
  "frontend/src/pages/WorkerProfilePage.tsx": "Shows a worker’s public profile with photo, details, pricing, location, and contact actions.",
  "frontend/src/utils/adminApiErrorHandling.ts": "Utility for classifying admin API errors and returning messages or redirecting on unauthorized cases.",
  "frontend/src/utils/adminSessionStorage.ts": "Manages admin session storage including save, retrieve, clear, and active checks.",
  "frontend/src/utils/authDiagnostics.ts": "Provides structured logging for authentication events, including attempts, successes, and failures.",
  "frontend/src/utils/categories.ts": "Defines category IDs, display names, and maps each category to an icon index and image path.",
  "frontend/src/utils/contactLinks.ts": "Provides helpers to normalize phone numbers and generate tel and WhatsApp links.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for getting, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and container settings with custom theme variables.",
  "project_state.json": "Describes project state, features, and requirements for restricting job completion actions to admin only."
}