{
  "backend/main.mo": "Defines categories, workers, inquiries, and user profiles with authorization, approval, and storage mixins; includes admin checks and CRUD state maps.",
  "feature_evidence.json": "Feature evidence report listing admin login button additions and routing behavior, mapping affected files and components.",
  "frontend-file-summaries.txt": "JSON-like text summarizing many frontend files including routing, hooks, UI components, worker flows, and admin panels.",
  "frontend/index.css": "Tailwind CSS base and theme variables for light/dark modes with extensive color tokens.",
  "frontend/index.html": "Basic HTML scaffold loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes including admin login and dashboard wrapped in AppLayout with theme provider and toaster.",
  "frontend/src/components/admin/CategoriesAdminPanel.tsx": "Admin UI to list, create, edit, and delete categories with dialog forms and mutation hooks.",
  "frontend/src/components/admin/InquiriesAdminPanel.tsx": "Admin panel for filtering, updating, and deleting inquiries with status controls and session-aware error handling.",
  "frontend/src/components/admin/WorkersAdminPanel.tsx": "Admin panel for listing, filtering, and approving/rejecting/removing worker accounts.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading states.",
  "frontend/src/components/Brand.tsx": "Displays the SevaSangam brand name in English, Hindi, and Assamese.",
  "frontend/src/components/categories/CategoryCardGrid.tsx": "Displays a grid of category cards linking to category pages with sprite-based icons.",
  "frontend/src/components/guards/RequireAdmin.tsx": "Route guard that restricts pages to authenticated admins and redirects or shows errors.",
  "frontend/src/components/guards/RequireAuth.tsx": "Requires user authentication and prompts Internet Identity login if not authenticated.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapping pages with header, footer, and content area.",
  "frontend/src/components/layout/Footer.tsx": "Simple footer displaying a copyright-style message.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with navigation, auth controls, and admin/user-specific links.",
  "frontend/src/components/search/HomeSearchPanel.tsx": "Home search form allowing users to filter workers by category, location, and availability.",
  "frontend/src/components/workers/PhotoPicker.tsx": "Photo upload component that previews and manages worker profile images using ExternalBlob.",
  "frontend/src/components/workers/WorkerCard.tsx": "Card UI showing a worker’s photo, details, and link to their profile.",
  "frontend/src/components/workers/WorkerContactActions.tsx": "Buttons for calling or WhatsApp messaging a worker using generated contact links.",
  "frontend/src/components/workers/WorkerProfileEditor.tsx": "Form component that edits an existing worker profile, handling major-field reapproval logic and updating structured profile data before submit.",
  "frontend/src/components/workers/WorkerRegistrationForm.tsx": "Registration form for creating a new worker profile, constructing a full WorkerProfile object using Internet Identity on submit.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin login state using stored credentials, validating access via actor calls and providing login/logout utilities.",
  "frontend/src/hooks/useAuthz.ts": "Aggregates worker and admin authentication states into a simple authorization object.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identity loading, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, categories, and admin-protected data via the actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark theming and UI color tokens.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up QueryClient, and wraps the app with InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabs for managing workers, categories, and inquiries, including logout handling and admin access guard.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login form with credential handling, error display, and redirect for already authenticated admins.",
  "frontend/src/pages/CategoriesIndexPage.tsx": "Displays all service categories with a grid of category cards.",
  "frontend/src/pages/CategoryPage.tsx": "Shows workers in a specific category with loading state and empty state handling.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring hero section, search panel, and category browsing.",
  "frontend/src/pages/SearchResultsPage.tsx": "Filters and displays workers based on search criteria with options to clear filters and handle empty results.",
  "frontend/src/pages/WorkerDashboardPage.tsx": "Worker dashboard for viewing and editing profile, showing status, and handling profile updates.",
  "frontend/src/pages/WorkerOnboardingPage.tsx": "Worker onboarding flow including Internet Identity login, user profile setup, and worker registration.",
  "frontend/src/pages/WorkerProfilePage.tsx": "Renders a worker profile page showing photo, details, pricing, availability, and contact actions, with loading and not-found states.",
  "frontend/src/utils/adminApiErrorHandling.ts": "Provides helpers to detect admin unauthorized errors and clear admin session with a user-friendly message.",
  "frontend/src/utils/adminSessionStorage.ts": "Manages admin session storage with functions to save, retrieve, clear, and check session state.",
  "frontend/src/utils/categories.ts": "Defines category IDs, names, and returns a numeric icon index for each worker category.",
  "frontend/src/utils/contactLinks.ts": "Generates normalized phone numbers and tel/WhatsApp links with optional messages.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL params, persisting them in sessionStorage, and clearing them from URL/hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and container settings for the project.",
  "project_state.json": "Project metadata describing goals, architecture, features, and current issues for SevaSangam."
}