{
  "backend/main.mo": "Defines actor with category, worker, and inquiry types plus access control, approval flow, and mutable in‑memory maps for storing all entities.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test mappings for recent UI and asset updates.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑sentence summaries for key frontend source files across components, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS base file defining theme variables, light/dark mode tokens, and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up all application routes with TanStack Router, wraps them in layout, i18n, theme provider, and toaster.",
  "frontend/src/components/admin/CategoriesAdminPanel.tsx": "Admin interface for listing, creating, editing, and deleting service categories with modal forms and toast feedback.",
  "frontend/src/components/admin/InquiriesAdminPanel.tsx": "Admin panel listing inquiries with filtering, status updates, deletion, and error handling.",
  "frontend/src/components/admin/WorkersAdminPanel.tsx": "Admin interface to view, filter, approve, reject, remove, publish, and unpublish worker profiles.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and session reset logic.",
  "frontend/src/components/Brand.tsx": "Displays the SevaSangam brand name in English, Hindi, and Assamese.",
  "frontend/src/components/categories/CategoryCardGrid.tsx": "Renders a grid of category cards linking to category pages with images and names.",
  "frontend/src/components/guards/RequireAdmin.tsx": "Protects admin routes by checking admin session and redirecting unauthenticated users.",
  "frontend/src/components/guards/RequireAuth.tsx": "Gatekeeper component requiring user authentication and prompting login when needed.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, footer, and main content structure.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying localized copyright text.",
  "frontend/src/components/layout/Header.tsx": "Site header with navigation, auth controls, language selector, and admin/worker session handling.",
  "frontend/src/components/search/HomeSearchPanel.tsx": "Search form allowing category, location, and availability filters, navigating to search results.",
  "frontend/src/components/workers/PhotoPicker.tsx": "Image picker for worker profile photos with preview, upload handling, and removal options.",
  "frontend/src/components/workers/WorkerCard.tsx": "Displays a worker’s basic info, photo, and location in a card with a link to their profile.",
  "frontend/src/components/workers/WorkerContactActions.tsx": "Provides call and WhatsApp action buttons for contacting a worker using generated links.",
  "frontend/src/components/workers/WorkerProfileEditor.tsx": "Form for editing an existing worker profile, handling major-field changes, photo updates, and submission.",
  "frontend/src/components/workers/WorkerRegistrationForm.tsx": "Form for creating a new worker profile, generating an ID and assembling all profile fields before submit.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin authentication state, validating credentials via backend and storing session info.",
  "frontend/src/hooks/useAuthz.ts": "Exposes authorization state combining worker identity and admin session flags.",
  "frontend/src/hooks/useI18n.ts": "Provides access to the i18n context for translations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing identity loading, login, logout, and status.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and categories, integrating admin auth and error handling.",
  "frontend/src/i18n/I18nProvider.tsx": "Defines an i18n context provider managing selected language, localStorage persistence, and translation access.",
  "frontend/src/i18n/index.ts": "Exports language maps and utility functions for nested lookup, interpolation, plurals, and translation resolution.",
  "frontend/src/i18n/locales/as.ts": "Contains Assamese translation strings for all UI sections.",
  "frontend/src/i18n/locales/en.ts": "Contains English translation strings for all UI sections.",
  "frontend/src/i18n/locales/hi.ts": "Contains Hindi translation strings for all UI sections.",
  "frontend/src/index.css": "Sets Tailwind base layers and custom CSS variables for theme colors, including dark mode variants.",
  "frontend/src/main.tsx": "Bootstraps the React app, wiring React Query and Internet Identity providers around the root component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for managing workers, categories, and inquiries, wrapped in an admin access guard. Includes logout logic that clears queries and navigates home.",
  "frontend/src/pages/AdminLoginPage.tsx": "Provides the admin login form with username/password handling, loading states, error display, and redirects authenticated admins to the dashboard.",
  "frontend/src/pages/CategoriesIndexPage.tsx": "Displays a page listing all service categories using the CategoryCardGrid component.",
  "frontend/src/pages/CategoryPage.tsx": "Shows workers in a specific category with loading, error, and empty states, fetching data based on the route parameter.",
  "frontend/src/pages/HomePage.tsx": "Builds the home page with a hero section, search panel, and featured categories, using i18n and navigation.",
  "frontend/src/pages/SearchResultsPage.tsx": "Filters all workers by query parameters and displays results with loading, error, and empty states plus filter controls.",
  "frontend/src/pages/WorkerDashboardPage.tsx": "Shows the logged-in worker’s profile, status, and editing options with update functionality and fallback for unregistered users.",
  "frontend/src/pages/WorkerOnboardingPage.tsx": "Handles worker onboarding flow including login, profile setup, and worker registration with conditional UI states.",
  "frontend/src/pages/WorkerProfilePage.tsx": "Fetches and displays a worker’s detailed profile including photo, experience, location, pricing, and contact actions.",
  "frontend/src/utils/adminApiErrorHandling.ts": "Provides helpers to detect admin API errors, clear sessions, and generate user-facing error messages with optional redirect.",
  "frontend/src/utils/adminSessionStorage.ts": "Manages saving, retrieving, and clearing admin session credentials in sessionStorage.",
  "frontend/src/utils/categories.ts": "Defines worker category IDs, names, and utilities to get associated icons and image paths.",
  "frontend/src/utils/contactLinks.ts": "Generates normalized phone numbers and tel/WhatsApp links for contacting workers.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and container settings.",
  "project_state.json": "Project state describing footer text changes and adding cartoon occupation images for each service category, including existing features and pending requests. Also lists required images and metadata like project version and modes."
}