{
  "kind": "build_request",
  "title": "Fix production regression: workers not visible publicly and pending list empty in Admin Dashboard",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Persist workers, categories, inquiries, and userProfiles across canister upgrades/deploys so that production deployments do not reset data and cause approved workers to disappear from public pages and pending workers to disappear from the Admin Dashboard.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-7",
          "msg-recent-8",
          "msg-recent-9"
        ],
        "quotes": [
          "on going live, the workers are not showing",
          "Approved workers are not showing.  Admin dashboard is not showing pending workers.",
          "Fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade/redeploy, previously registered workers (Pending/Approved/Rejected) still exist in canister state and can be fetched via the same APIs as before.",
        "After an upgrade/redeploy, previously created categories still exist in canister state and can be fetched via getAllCategories/getCategory.",
        "After an upgrade/redeploy, approved workers remain publicly visible via getAllWorkers/getWorkersByCategory/getWorkerProfile (for approved/featured only).",
        "No migration file is introduced unless required to preserve existing production state; if a migration is required, it is implemented according to the platform conditional migration policy."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Ensure the Admin Dashboard worker list reliably shows Pending workers in production by (a) making the admin worker fetch return real data (not an empty list caused by backend state reset) and (b) adding explicit error UI when the admin worker query fails (network/unauthorized) instead of silently showing an empty state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-7",
          "msg-recent-8"
        ],
        "quotes": [
          "Admin dashboard is not showing pending workers.",
          "on going live, the workers are not showing"
        ]
      },
      "acceptanceCriteria": [
        "When the backend returns pending workers from getAllWorkersAdmin, the WorkersAdminPanel default filter 'pending' shows them.",
        "If useGetAllWorkersAdmin fails due to unauthorized, the admin session is cleared and the UI navigates to /admin-login (existing behavior), and the panel does not display a misleading 'No workers found' empty state before redirect.",
        "If useGetAllWorkersAdmin fails due to a network/connection error, the panel shows an error message in English (e.g., 'Connection problem. Please try again.') with a retry action, and does not present an empty list as if there are no workers.",
        "The loading state, empty state, and error state are visually distinct in WorkersAdminPanel."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Ensure approved workers reliably appear on public category pages and search results in production by surfacing query errors (instead of silently treating actor/unreachable errors as an empty list) and by ensuring public worker queries refetch successfully after deployment and after admin approval actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-7",
          "msg-recent-8"
        ],
        "quotes": [
          "Approved workers are not showing.",
          "on going live, the workers are not showing"
        ]
      },
      "acceptanceCriteria": [
        "If the public worker queries fail due to a network/connection issue, CategoryPage and SearchResultsPage show an error state in English with a retry option (not '0 workers available' as if there are none).",
        "If public worker queries succeed, CategoryPage counts and renders approved workers correctly for the selected category.",
        "After a worker is approved in the Admin Dashboard, navigating to the worker’s category page and the Search Results page shows the approved worker without requiring a hard refresh (relies on successful refetch/invalidation and successful backend persistence)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for all user-facing text added or modified."
  ],
  "nonGoals": [
    "Adding new product features (e.g., bookings, payments, messaging) beyond fixing worker visibility and related error handling.",
    "Changing authentication methods (workers still use Internet Identity; admin still uses the custom username/password session).",
    "Introducing external databases or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}