{
  "kind": "build_request",
  "title": "Restrict job completion to admin only and reflect completion status for workers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the ability for workers to mark jobs/inquiries as completed from the worker UI by hiding the \"Mark as Completed\" button and eliminating any worker-side action that triggers completion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "the \"Mark Completed\" button should only be visible on the admin’s interface and completely hidden from the worker’s view.",
          "the system is simply not involved (they only call the admin )."
        ]
      },
      "acceptanceCriteria": [
        "In the worker dashboard jobs list, no \"Mark as Completed\" (or equivalent) button/action is visible for any job status.",
        "Worker UI does not attempt to call any completion mutation/API when a job is pending/new.",
        "The worker jobs list still shows status badges (e.g., Pending/Completed) based on the inquiry status."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Provide an admin-only \"Mark Completed\" control in the admin interface to set a job/inquiry status to completed, and ensure that once the admin marks it completed, workers see the same job as completed in their dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "only admin will mark the complete button, once the work is done. not the worker.",
          "yes, it should show as task completed on the worker side too after admin marks it as job completed."
        ]
      },
      "acceptanceCriteria": [
        "In the admin inquiry management UI, admins can mark an inquiry as completed via an explicit admin-only action (e.g., a \"Mark Completed\" button) for non-completed inquiries.",
        "After the admin marks an inquiry completed, the worker dashboard jobs list reflects the job as \"Completed\" (badge/label) after data refresh (React Query invalidation/refetch).",
        "No admin completion controls are shown anywhere in the worker-facing UI."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update backend authorization so that worker callers cannot mark an inquiry/job as completed via dedicated completion endpoints; completion must be an admin-only operation (e.g., via existing admin update inquiry flows).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "only admin will mark the complete button, once the work is done. not the worker."
        ]
      },
      "acceptanceCriteria": [
        "Calls to backend completion methods intended for workers (e.g., markInquiryAsCompleted/markJobAsCompleted) fail for non-admin callers with an unauthorized error/trap.",
        "Admin can still set an inquiry to completed through existing admin-authorized update mechanisms (e.g., updateInquiry with admin credentials).",
        "Worker job status returned by getMyWorkItems reflects the updated completed status after admin updates it."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit frontend immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/main.tsx, frontend/src/components/ui).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if state schema changes require migration."
  ],
  "nonGoals": [
    "Do not add any in-app worker workflow for notifying admin of completion (worker will call admin outside the system).",
    "Do not implement real-time updates (e.g., websockets/push); status updates can rely on refetch/invalidation.",
    "Do not change inquiry/job data model unless required to enforce authorization."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}