{
  "kind": "build_request",
  "title": "Simplify worker dashboard and restore admin 'Mark Completed' per worker job cards",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all statistic/summary boxes from the Worker Dashboard so the worker sees no job summary metrics (e.g., Total Jobs, Pending, Completed) and the page remains functional with the worker’s job list section intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "remove work assigned, pending, total jobs and all from worker's dashboard",
          "yes, i want every statistic/summary box removed from the worker dashboard, leaving only their job list"
        ]
      },
      "acceptanceCriteria": [
        "On WorkerDashboardPage, the summary/stat cards (Total Jobs, Pending, Completed) are not rendered.",
        "Worker dashboard still renders the 'My Jobs' list as before (including empty/loading/error states).",
        "No new statistics/summary UI is introduced elsewhere on the worker dashboard as a replacement."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the Admin Dashboard’s worker management view, show each worker’s assigned jobs (inquiries) and render a visible 'Mark Completed' button on each individual job card for that worker when the job is not yet completed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "'mark completed' button is still not showing in the admin dashboard, in the respective workers jobs. fix all that.",
          "yes, the button should appear on each individual job card inside each worker’s job list"
        ]
      },
      "acceptanceCriteria": [
        "In WorkersAdminPanel, each worker card includes a list of that worker’s inquiries (filtered by worker_id) with a per-inquiry/job card UI.",
        "Each inquiry/job card in the worker’s job list shows a 'Mark Completed' button when its status is not completed.",
        "The 'Mark Completed' button is not shown for jobs already completed."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Wire the Admin 'Mark Completed' button to update the inquiry status to completed using existing admin-authorized backend calls, then refresh relevant admin and worker job data so the completed status appears immediately.",
      "target": "both",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "fix all that. make it flawless. dont repeat mistakes"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Mark Completed' updates the corresponding inquiry’s status to completed via an admin-authorized backend call (no worker-auth flow).",
        "After completion, the admin UI reflects the updated completed status without a full page reload (queries are invalidated/refetched).",
        "The worker’s 'My Jobs' list reflects the updated completed status after the relevant query refetch/invalidation."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components).",
    "Do not modify frontend immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; add migration.mo only if state schema changes (avoid schema changes for this request)."
  ],
  "nonGoals": [
    "Do not add new worker-visible controls to complete jobs (job completion remains admin-only).",
    "Do not change admin authentication/credential behavior beyond what is required to make 'Mark Completed' work.",
    "Do not redesign unrelated admin panels (Categories/Inquiries panels) except as needed for this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}