{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify worker dashboard and restore admin per-job 'Mark Completed' actions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all job statistic/summary cards from the Worker Dashboard while keeping the 'My Jobs' list behavior unchanged.",
      "acceptanceCriteria": [
        "On WorkerDashboardPage, the summary/stat cards (Total Jobs, Pending, Completed) are not rendered.",
        "Worker dashboard still renders the 'My Jobs' list as before (including empty/loading/error states).",
        "No new statistics/summary UI is introduced elsewhere on the worker dashboard as a replacement."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WorkerDashboardPage.tsx",
          "operation": "modify",
          "description": "Remove the summary/statistics Card grid (Total Jobs/Pending/Completed) and any now-unused derived counts/imports, ensuring the 'My Jobs' section (loading/error/empty states via WorkerJobsList) remains intact and functional."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "In the Admin Dashboard worker management view, render each worker’s assigned inquiries as job cards with a per-card 'Mark Completed' control when not completed.",
      "acceptanceCriteria": [
        "In WorkersAdminPanel, each worker card includes a list of that worker’s inquiries (filtered by worker_id) with a per-inquiry/job card UI.",
        "Each inquiry/job card in the worker’s job list shows a 'Mark Completed' button when its status is not completed.",
        "The 'Mark Completed' button is not shown for jobs already completed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/WorkersAdminPanel.tsx",
          "operation": "modify",
          "description": "Extend each worker Card to include a nested list of that worker’s inquiries (filtered from inquiriesAdmin by worker_id). Render each inquiry as its own job card row/mini-card with status display and a visible 'Mark Completed' Button only when status is not completed; keep existing worker management controls unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Wire the Admin per-job 'Mark Completed' action to the existing admin-authorized inquiry update call and refresh admin + worker job data immediately via React Query invalidation/refetch.",
      "acceptanceCriteria": [
        "Clicking 'Mark Completed' updates the corresponding inquiry’s status to completed via an admin-authorized backend call (no worker-auth flow).",
        "After completion, the admin UI reflects the updated completed status without a full page reload (queries are invalidated/refetched).",
        "The worker’s 'My Jobs' list reflects the updated completed status after the relevant query refetch/invalidation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/WorkersAdminPanel.tsx",
          "operation": "modify",
          "description": "Use the existing useUpdateInquiry mutation to implement the per-inquiry 'Mark Completed' handler (setting status to completed), add in-flight UI state (disable the clicked button / show progress), and rely on React Query invalidation to refresh both admin inquiries data and worker job lists."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden React Query cache refresh for admin inquiry updates: ensure useUpdateInquiry (and any related inquiry mutations) invalidates/refetches admin inquiries queries and the worker job list queries (including the exact worker 'me' key), so both AdminDashboard and WorkerDashboard reflect completion immediately without a full reload."
        }
      ]
    }
  ]
}