{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix worker visibility regression by surfacing admin/public query errors and enabling reliable refetch",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Make Admin Dashboard Pending workers list reliable by adding explicit fetch error UI (unauthorized/network) and preventing empty-state flicker before redirect.",
      "acceptanceCriteria": [
        "When the backend returns pending workers from getAllWorkersAdmin, the WorkersAdminPanel default filter 'pending' shows them.",
        "If useGetAllWorkersAdmin fails due to unauthorized, the admin session is cleared and the UI navigates to /admin-login (existing behavior), and the panel does not display a misleading 'No workers found' empty state before redirect.",
        "If useGetAllWorkersAdmin fails due to a network/connection error, the panel shows an error message in English (e.g., 'Connection problem. Please try again.') with a retry action, and does not present an empty list as if there are no workers.",
        "The loading state, empty state, and error state are visually distinct in WorkersAdminPanel."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useGetAllWorkersAdmin to stop returning an empty list on missing/invalid admin session and to propagate failures via React Query error state; ensure unauthorized failures trigger admin-session clearing + navigation to /admin-login without returning misleading empty data."
        },
        {
          "path": "frontend/src/components/admin/WorkersAdminPanel.tsx",
          "operation": "modify",
          "description": "Use React Query states from useGetAllWorkersAdmin (isLoading/isError/error/refetch) to render distinct loading vs error vs empty vs success UI; add an English network error message with a retry action; ensure unauthorized errors render a redirecting/blocked state rather than the 'No workers found' empty state. Use existing shadcn-ui components (Button/Card/Badge/Select) to compose the UI (do not edit ui components). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/adminApiErrorHandling.ts",
          "operation": "modify",
          "description": "Extend admin error helpers to support WorkersAdminPanel needs: provide a way to classify unauthorized vs network vs generic errors and support immediate redirect behavior for unauthorized cases to avoid empty-state flicker; keep all user-facing text in English."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Ensure public Category and Search Results pages surface worker query failures with retry and refetch reliably after deployments and admin approval actions.",
      "acceptanceCriteria": [
        "If the public worker queries fail due to a network/connection issue, CategoryPage and SearchResultsPage show an error state in English with a retry option (not '0 workers available' as if there are none).",
        "If public worker queries succeed, CategoryPage counts and renders approved workers correctly for the selected category.",
        "After a worker is approved in the Admin Dashboard, navigating to the worker’s category page and the Search Results page shows the approved worker without requiring a hard refresh (relies on successful refetch/invalidation and successful backend persistence)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust public worker query hooks (useGetAllWorkers, useGetWorkersByCategory) to avoid silently treating failures as empty lists; ensure errors propagate to components via React Query error state while preserving correct enabled/initial actor behavior and allowing refetch/invalidation to work after deployments and admin approval actions."
        },
        {
          "path": "frontend/src/pages/CategoryPage.tsx",
          "operation": "modify",
          "description": "Render distinct loading/empty/error/success states for the category workers query; when the query fails (e.g., network/connection), show an English error message with a retry action that calls refetch, instead of showing 'No workers found' based on empty data. Use existing shadcn-ui Button and existing layout patterns; do not edit ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SearchResultsPage.tsx",
          "operation": "modify",
          "description": "Render distinct loading/empty/error/success states for the all-workers query; when the query fails (e.g., network/connection), show an English error message with a retry action that calls refetch, instead of showing 0 results as if there are no workers. Use existing shadcn-ui Button and existing layout patterns; do not edit ui components. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}