{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin-only job completion controls with worker status reflection",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove worker-side job completion action while preserving status visibility in the worker dashboard.",
      "acceptanceCriteria": [
        "In the worker dashboard jobs list, no \"Mark as Completed\" (or equivalent) button/action is visible for any job status.",
        "Worker UI does not attempt to call any completion mutation/API when a job is pending/new.",
        "The worker jobs list still shows status badges (e.g., Pending/Completed) based on the inquiry status."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/workers/WorkerJobsList.tsx",
          "operation": "modify",
          "description": "Remove the worker-only completion UI by deleting the \"Mark as Completed\" button rendering and eliminating the onMarkCompleted/markingJobId props; keep status badges (Pending/Completed) driven by InquiryStatus. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/WorkerDashboardPage.tsx",
          "operation": "modify",
          "description": "Remove all worker-side completion wiring: drop useMarkInquiryAsCompleted import/usage, remove marking state and handler, and render WorkerJobsList without completion-related props while still showing status/counts based on InquiryStatus. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove the worker completion mutation hook (useMarkInquiryAsCompleted) so the worker UI cannot trigger completion; ensure any remaining worker job queries (useGetMyWorkItems) continue to drive status display and refresh behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an explicit admin-only \"Mark Completed\" control in admin inquiry management and ensure worker dashboards reflect completion after refresh/invalidation.",
      "acceptanceCriteria": [
        "In the admin inquiry management UI, admins can mark an inquiry as completed via an explicit admin-only action (e.g., a \"Mark Completed\" button) for non-completed inquiries.",
        "After the admin marks an inquiry completed, the worker dashboard jobs list reflects the job as \"Completed\" (badge/label) after data refresh (React Query invalidation/refetch).",
        "No admin completion controls are shown anywhere in the worker-facing UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/InquiriesAdminPanel.tsx",
          "operation": "modify",
          "description": "Add an explicit \"Mark Completed\" admin-only button per inquiry (shown only when status is not completed) that triggers the existing admin update flow to set status to completed; rely on existing RequireAdmin/admin session gating for admin-only access (authorization component role-based access control). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Confirm/adjust React Query invalidation so that successful admin inquiry updates that set status to completed invalidate/refetch both admin inquiries and worker jobs queries (e.g., ['workerJobs','me']) to reflect completion on the worker dashboard after refresh. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}